soap/test/resources/tttRequestFromOriginalCode.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			soapenv:mustUnderstand="true">
			<wsu:Timestamp
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				wsu:Id="_1">
				<wsu:Created>2013-01-31T20:22:21Z</wsu:Created>
				<wsu:Expires>2013-01-31T20:27:21Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_8CFB2C32F2E971FB4013596637409731"
				IssueInstant="2013-01-31T20:22:20.973Z" Version="2.0" xsi:type="saml:AssertionType">
				<saml:Issuer
					Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=lambdaMan@nist.gov,O=Nist Test
					Lab,L=Gaithersburg,ST=Maryland,C=US</saml:Issuer>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#_8CFB2C32F2E971FB4013596637409731">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>sE7BKauB7CUQ30R2IvIk3By7mq0=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>YdNaExNxoNuc7awlVuuRvWZP2rLf6LBMSkesq+LFZFyvRLjmXcTn6CWBaZ/FR5whv8vvAgqFCA14
						ZAUSqghdEKnIbjJ32qcyCPjDr/qFLCb0GpwLdrA1EEFvgk3doZReohLqSg/uPgEJHJAC2mp7p5t3
						rajW4wgg+hmPb1DWzLM4Lki12fT/ie26/nJ/fzDb/z4gxB2W/ipKD4Qz651QOLUMOELtSqY8ZPKw
						mHEwedi1b0HSW92t4KErMcX0n3DePE2r2/wfurxQY244FJEwpNlwbPlzpkJLDI9zLkopZxHeGqR2
						dF1uS3hLe+usp7u1yRnz+bKE4+NUv2PA+yxdLw==
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
									BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
									/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
									PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
									xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==
								</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
				<saml:Subject>
					<saml:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">uid=joe,ou=people,ou=saml-demo,o=example.com</saml:NameID>
					<saml:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml:SubjectConfirmationData
							xsi:type="saml:KeyInfoConfirmationDataType">
							<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>lYGm36g0r4b/oqHbIfubfylKC1fIQUAT2w0IgnwPFqmpKvrvpz8JebHLVTsADxrX8j3C+FyUdC3n
											BFTihya8s9VmW3OfdX3e/XuQcpIqCA3uloUCVsNdEw8+H5fBuGdCYKVnZa38CvqZOajkMqHHt1MS
											/hZqEJKk1S0xKdLSy4ZiGlU/q7LMheWkJSQ0NSxsx9G5y9qAWKIH4G0HjwBU1Fu6FV+YcBCwCDqy
											PHL/aymm4RYB3zBTiXIBw7b1MeTYFFRmBF59ATklpAyXuxhBytIarwmZFzpZbnuiEB8ucJRJM72k
											xtBs26hHmM1CHCFXpxZ5PoG9DVWftBebsBLNew==
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml:SubjectConfirmationData>
					</saml:SubjectConfirmation>
				</saml:Subject>
				<saml:AuthnStatement AuthnInstant="2013-01-31T20:22:20.975Z"
					SessionIndex="12345">
					<saml:SubjectLocality Address="158.147.185.10"
						DNSName="ssa.gov" />
					<saml:AuthnContext>
						<saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509
						</saml:AuthnContextClassRef>
					</saml:AuthnContext>
				</saml:AuthnStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">uid=joe,ou=people,ou=saml-demo,o=example.com
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">Social Security
							Administration</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute
						Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.184.6.1
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:nhin:names:saml:homeCommunityId"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.184.6.1
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">2.16.840.1.113883.3.18.6.1.15
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">2.16.840.1.113883.3.184.6.1
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id"
						NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
						<saml:AttributeValue xsi:type="xs:string">2.16.840.1.113883.3.184.6.1
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AuthzDecisionStatement Decision="Permit"
					Resource="https://nhinri2c23.aegis.net:443/RespondingGateway_Query_Service/DocQuery">
					<saml:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml:Action>
					<saml:Evidence>
						<saml:Assertion ID="_8CFB2C32F2E971FB4013596637409822"
							IssueInstant="2013-01-31T20:22:20.982Z" Version="2.0"
							xsi:type="saml:AssertionType">
							<saml:Issuer
								Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=lambdaMan@nist.gov,O=Nist Test
								Lab,L=Gaithersburg,ST=Maryland,C=US</saml:Issuer>
							<saml:Conditions NotBefore="2013-01-31T20:22:20.983Z"
								NotOnOrAfter="2013-01-31T20:27:20.983Z" />
							<saml:AttributeStatement>
								<saml:Attribute Name="InstanceAccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin">
									<saml:AttributeValue xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.184.6.1.2222
									</saml:AttributeValue>
								</saml:Attribute>
							</saml:AttributeStatement>
						</saml:Assertion>
					</saml:Evidence>
				</saml:AuthzDecisionStatement>
			</saml:Assertion>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="_2">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces
							xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="wsse soapenv" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform
								Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>ojPbM2M7/7ByzMJ+7pAHVxTsQRM=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>DWYejtCm4UDe0S/9E5RRC3eCwZBvnuclTQu/jP8LqXP63I9wxtEtYEFksl2QCb+4AYQWAzIRBQID
					59N/UkEbVDa7VMznEKdqgkteTQugXMBa8PdKLVh6hkLGwa31wFBwNHepIMZQoLuUKz7XOhaneXLK
					MdIrfttOxS1HTb/bLJII+dIVe7/sMW7eMSEFtXZM0+WIPWBDAXw6TMimpwj/MuiXlvGtsf0/4Raf
					mAZ8fasXbc9AWR5s5EH5zutXRuySpU3BAMrAcCeTRNKokDsu/SGhoq+528uQ5YonrNZ5/Tn2Kb1u
					9qUZzTP4JAq7jbha8sTPOcU43oBpZPaI2PyArQ==
				</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference
						xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_8CFB2C32F2E971FB4013596637409731</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
		<wsa:To soapenv:mustUnderstand="true">https://192.168.188.128:9892/Gateway/DocumentQuery/2_0/NhinService/RespondingGateway_Query_Service/DocQuery
		</wsa:To>
		<wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:55D434CBE104C1DCF41359663741238
		</wsa:MessageID>
		<wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:CrossGatewayQuery
		</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<query:AdhocQueryRequest
			xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
			xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<query:ResponseOption returnComposedObjects="true"
				returnType="ObjectRef" />
			<AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d"
				home="1.1">
				<Slot name="$XDSDocumentEntryPatientId">
					<ValueList>
						<Value>'500000000^^^&amp;2.2&amp;ISO'</Value>
					</ValueList>
				</Slot>
				<Slot name="$XDSDocumentEntryStatus">
					<ValueList>
						<Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved',
							'urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</Value>
					</ValueList>
				</Slot>
			</AdhocQuery>
		</query:AdhocQueryRequest>
	</soapenv:Body>
</soapenv:Envelope>