input/images-source/QDI-SAML-20211210.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope
    xmlns:S="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
  <S:Header>
    <wsa:To>https://exttestgw3....</wsa:To>
    <wsa:Action>urn:ihe:iti:2007:CrossGatewayQuery</wsa:Action>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:MessageID>uuid:df9b89ed-395e-40a7-8510-0b4a390434c4</wsa:MessageID>
    <wsse:Security
        S:mustUnderstand="true">
      <wsu:Timestamp wsu:Id="_1">
        <wsu:Created>2010-04-26T16:42:03Z</wsu:Created>
        <wsu:Expires>2010-04-26T16:47:03Z</wsu:Expires>
      </wsu:Timestamp>
      <saml2:Assertion
          xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
          xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"
          xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
          xmlns:xs="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:hl7="urn:hl7-org:v3"
          ID="_d87f8adf-711a-4545-bf77-ff8517b498e4"
          IssueInstant="2010-04-26T16:42:03.466Z"
          Version="2.0">
        <saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName"
          >CN=John Miller,OU=Harris,O=HITS,L=Melbourne,ST=FL,C=US</saml2:Issuer>
        <ds:Signature">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
            <ds:Reference URI="#_d87f8adf-711a-4545-bf77-ff8517b498e4">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <ds:DigestValue>uZbPfXMzJU+7baP4ZuLXN4r9rnQ=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>lrdNCxU5Hsqwhbjvjj....</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:KeyValue>
              <ds:RSAKeyValue>
                <ds:Modulus>nHHBiPKlFjFiVgw/....</ds:Modulus>
                <ds:Exponent>AQAB</ds:Exponent>
              </ds:RSAKeyValue>
            </ds:KeyValue>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName"
            >UID=kskagerb</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
            <saml2:SubjectConfirmationData>
              <ds:KeyInfo>
                <ds:KeyValue>
                  <ds:RSAKeyValue>
                    <ds:Modulus>nHHBiPKlFjFiVgw....</ds:Modulus>
                    <ds:Exponent>AQAB</ds:Exponent>
                  </ds:RSAKeyValue>
                </ds:KeyValue>
              </ds:KeyInfo>
            </saml2:SubjectConfirmationData>
          </saml2:SubjectConfirmation>
        </saml2:Subject>
        <saml2:AuthnStatement
            AuthnInstant="2009-04-16T13:15:39.000Z"
            SessionIndex="987">
          <saml2:SubjectLocality
            Address="158.147.185.168"
            DNSName="cs.myharris.net"/>
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
            <saml2:AttributeValue xsi:type="xs:string">Karl S Skagerberg</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
            <saml2:AttributeValue xsi:type="xs:string">connectred5.fedsconnect.org</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
            <saml2:AttributeValue xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.333</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
            <saml2:AttributeValue xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.333</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
            <saml2:AttributeValue>
              <hl7:Role
                  code="307969004"
                  codeSystem="2.16.840.1.113883.6.96"
                  codeSystemName="SNOMED_CT"
                  displayName="Public health officer"
                  xsi:type="hl7:CE" />
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
            <saml2:AttributeValue>
              <hl7:PurposeForUse
                  code="PUBLICHEALTH"
                  codeSystem="2.16.840.1.113883.3.18.7.1"
                  codeSystemName="nhin-purpose"
                  displayName="Uses and disclosures for public health activities."
                  xsi:type="hl7:CE" />
           </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
            <saml2:AttributeValue xsi:type="xs:string">500000000^^^&amp;2.16.840.1.113883.3.333&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
        <saml2:AuthzDecisionStatement
            Decision="Permit"
            Resource="https://exttestgw3....">
          <saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
          <saml2:Evidence>
            <saml2:Assertion
                ID="40df7c0a-ff3e-4b26-baeb-f2910f6d05a9"
                IssueInstant="2009-04-16T13:10:39.093Z"
                Version="2.0">
              <saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName"
                >CN=SAML User,OU=Harris,O=HITS,L=Melbourne,ST=FL,C=US</saml2:Issuer>
              <saml2:Conditions NotBefore="2010-04-26T04:00:00.000Z" NotOnOrAfter="2010-05-26T04:00:00.000Z" />
              <saml2:AttributeStatement>
                <saml2:Attribute
                    Name="AccessConsentPolicy"
                    NameFormat="http://www.hhs.gov/healthit/nhin">
                  <saml2:AttributeValue xsi:type="xs:string">urn:oid:1.2.3.4</saml2:AttributeValue>
                </saml2:Attribute>
                <saml2:Attribute
                    Name="InstanceAccessConsentPolicy"
                    NameFormat="http://www.hhs.gov/healthit/nhin">
                  <saml2:AttributeValue xsi:type="xs:string">urn:oid:1.2.3.4.123456789</saml2:AttributeValue>
                </saml2:Attribute>
              </saml2:AttributeStatement>
            </saml2:Assertion>
          </saml2:Evidence>
        </saml2:AuthzDecisionStatement>
      </saml2:Assertion>
      <ds:Signature Id="_2">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <exc14n:InclusiveNamespaces PrefixList="wsse S" />
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
          <ds:Reference URI="#_1">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <exc14n:InclusiveNamespaces PrefixList="wsu wsse S" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <ds:DigestValue>zRmZdVmQF7RvzfkT756wUPWfFwA=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>aypteGQSvN9ky....</ds:SignatureValue>
        <ds:KeyInfo>
          <wsse:SecurityTokenReference
              wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
            <wsse:KeyIdentifier
                ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID"
              >_d87f8adf-711a-4545-bf77-ff8517b498e4</wsse:KeyIdentifier>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </S:Header>
  <S:Body>
    <query:AdhocQueryRequest
        xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
        xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
      <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
      <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <rim:Slot name="$XDSDocumentEntryPatientId">
          <rim:ValueList>
            <rim:Value>'N600001^^^&amp;2.16.840.1.113883.3.333&amp;ISO'</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="$XDSDocumentEntryStatus">
          <rim:ValueList>
            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
          </rim:ValueList>
        </rim:Slot>
      </rim:AdhocQuery>
    </query:AdhocQueryRequest>
  </S:Body>
</S:Envelope>